read_liberty ../lib4.lib
synth -top top
write_verilog synth.v
