read_verilog -lib ../top.v
read_verilog ../top.v
synth -top top
write_verilog synth.v
