read_liberty -setattr a ../lib.lib
synth -top top
write_verilog synth.v
