verilog_defines -D type
read_verilog ../top.v
proc
write_verilog synth.v
