read_verilog ../top.v
memory_collect
proc
clk2fflogic
tee -o result.log dump
synth -top top
design -reset
read_verilog ../top.v
synth -top top
write_verilog synth.v
