read_verilog ../top.v
deminout
tee -o result.log dump
write_verilog synth.v
