read_verilog ../top.v
synth -top top
flowmap -debug-relax top
write_verilog synth.v
