read_verilog ../top.v
synth -top top
flowmap top
write_verilog synth.v
