read_verilog ../top.v
synth -top top
flowmap -relax -debug-relax top
write_verilog synth.v
