read_verilog ../top.v
synth -top top
flowmap -debug top
write_verilog synth.v
