read_verilog ../top.v
proc
fsm_detect
fsm_extract
fsm_export -noauto
opt
fsm_opt
tee -o result.log dump
synth -top top
write_verilog synth.v
