read_verilog ../top.v
proc
fsm -encfile fsm.fsm
tee -o result.log dump
synth -top top
write_verilog synth.v
