read_verilog ../top.v
hierarchy -nokeep_asserts -top top
synth -top top
write_verilog synth.v 
