read_verilog ../top.v
proc
alumacc
maccmap -unmap
tee -o result.log dump
synth -top top
write_verilog synth.v
