read_verilog ../top.v
proc
memory_share
memory_dff
memory_share
opt_clean
memory_share
memory_nordff
opt_clean
memory_share
memory_collect
memory_share
memory_nordff
memory_share
memory_map
memory_share
memory
memory_share
tee -o result.log dump
design -reset
read_verilog ../top.v
synth -top top
write_verilog synth.v
