read_verilog ../top.v
prep
synth -top top
write_verilog synth.v
