read_verilog ../top.v
proc
share -force
synth -top top
write_verilog synth.v
