read_verilog ../top.v
proc
share -aggressive
synth -top top
write_verilog synth.v
