read_verilog ../top.v
synth_greenpak4 -run begin:map_luts
shregmap -match foobar -enpol any
design -reset
read_verilog ../top.v
write_verilog synth.v
