read_verilog ../top.v
synth -auto-top
write_verilog synth.v
