read_verilog ../top.v
synth -abc9
write_verilog synth.v
