read_verilog ../top.v
synth -nordff
write_verilog synth.v
