read_verilog ../top.v
proc
techmap -recursive
synth
write_verilog synth.v
