read_verilog ../top.v
tribuf -logic tristate
tribuf -merge tristate
synth -top top
tribuf -merge -logic tristate
tee -o result.log dump
write_verilog synth.v
