read_verilog ../top.v
synth -top top
uniquify
write_verilog synth.v 
