read_verilog ../top.v
synth -top top
zinit -all
tee -o result.log dump
write_verilog synth.v
