read_verilog ../top.v
aigmap -nand
tee -o result.log dump
proc
aigmap -nand
synth -top top
aigmap -nand
write_verilog synth.v
