read_verilog ../top.v
extract  -map ../top.v -verbose
design -reset
read_verilog ../top.v
proc
write_verilog synth.v
