read_verilog ../top.v
synth -top top
flowmap
tee -o result.log dump
write_verilog synth.v
