read_verilog ../top.v
synth -top top
flowmap -r-gamma 3 top
write_verilog synth.v
