read_verilog ../top.v
synth -top top
abc -g gates
write_verilog synth.v
