read_verilog ../top.v
hierarchy -keep_positionals -top top
synth -top top
write_verilog synth.v 
