read_verilog ../top.v
hierarchy -check -top top
synth -top top
write_verilog synth.v 
