read_verilog ../top.v
hierarchy
proc
hierarchy
opt
hierarchy
synth -top top
hierarchy
write_verilog synth.v 
