read_verilog ../top.v
hierarchy -purge_lib -top top
synth -top top
write_verilog synth.v 
