read_verilog ../top.v
synth -top top
muxcover -mux16
tee -o result.log dump
write_verilog synth.v
