read_verilog ../top.v
synth_ice40
ice40_unlut
opt_lut -dlogic a
design -reset
read_verilog ../top.v
synth -top top
write_verilog synth.v
