read_verilog ../top.v
synth
splice
simplemap top
synth
write_verilog synth.v
