read_verilog ../top.v
submod
synth -top top
write_verilog synth.v
