read_verilog ../top.v
synth -lut 5
write_verilog synth.v
