read_verilog ../top.v
proc
techmap -max_iter 2
synth
write_verilog synth.v
