read_verilog ../top.v
proc
tribuf tristate
tee -o result.log dump
synth -top top
write_verilog synth.v
