read_verilog -defer ../top.v
chparam -set incr 42 topmod
synth -top top
write_verilog synth.v
