read_verilog ../top.v
synth_xilinx
tee -a result.log dump t:FDRE

