read_verilog ../top.v
synth_xilinx -top top
cd top
select -assert-count 1 t:RAMB18E1