
read_verilog rtl/omsp_alu.v
read_verilog rtl/omsp_and_gate.v
read_verilog rtl/omsp_clock_gate.v
read_verilog rtl/omsp_clock_module.v
read_verilog rtl/omsp_clock_mux.v
read_verilog rtl/omsp_dbg_hwbrk.v
read_verilog rtl/omsp_dbg_uart.v
read_verilog rtl/omsp_dbg.v
read_verilog rtl/omsp_execution_unit.v
read_verilog rtl/omsp_frontend.v
read_verilog rtl/omsp_mem_backbone.v
read_verilog rtl/omsp_multiplier.v
read_verilog rtl/omsp_register_file.v
read_verilog rtl/omsp_scan_mux.v
read_verilog rtl/omsp_sfr.v
read_verilog rtl/omsp_sync_cell.v
read_verilog rtl/omsp_sync_reset.v
read_verilog rtl/omsp_wakeup_cell.v
read_verilog rtl/omsp_watchdog.v
read_verilog rtl/openMSP430.v

hierarchy -top openMSP430
script ../scripts/generic-fsm.ys

write_verilog -noexpr -noattr output/synth.v

