
read_verilog rtl/pcm_slv_top.v

hierarchy -top pcm_slv_top
script ../scripts/generic.ys

write_verilog -noattr output/synth.v

