read_verilog ../top.v
synth -top top
tee -o result.log  abc -liberty  -constr top.lib
