read_verilog ../top.v
select -add top
tee -o result.log select -assert-max 15 top
proc
select -add top
tee -o result.log select -assert-max 15 top
tee -o result.log select -list
