read_verilog ../top.v
select -none
tee -o result.log select -assert-none x
proc
select -none
tee -o result.log select -assert-none x
tee -o result.log select -list
