read_verilog -sv ../top.v
splitnets -driver
tee -o result.log dump
