read_liberty ../liblat1.lib
synth -top top
write_verilog synth.v
