read_liberty ../libbbb.lib
synth -top top
write_verilog synth.v
