read_verilog -nomeminit ../top.v
synth -top top
write_verilog synth.v
