read_verilog -Idir ../top.v
synth -top top
write_verilog synth.v
