read_verilog -dump_ast2 ../top.v
synth -top top
write_verilog synth.v
