read_liberty -ignore_miss_func ../lib.lib
synth -top top
write_verilog synth.v
