read_verilog ../top.v
synth_easic -run begin:vlog
write_verilog synth.v 
