read_verilog ../top.v
synth_ice40 -vpr
write_verilog synth.v 
