read_verilog ../top.v
synth_ecp5 -noflatten
write_verilog synth.v 
