read_verilog ../top.v
synth_ecp5 -noccu2
write_verilog synth.v 
