read_verilog ../top.v
select top2
synth_gowin
write_verilog synth.v
