read_verilog ../top.v
select dffe
synth_anlogic
write_verilog synth.v
