read_verilog ../top.v
synth_efinix
write_verilog synth.v
