read_verilog ../top.v
synth_greenpak4 -json json.json
write_verilog synth.v 
