read_verilog ../top.v
synth_easic
write_verilog synth.v 
