read_verilog ../top.v
synth_sf2 -noflatten
write_verilog synth.v 
