read_verilog ../top.v
synth_easic -retime
write_verilog synth.v 
