read_verilog ../top.v
synth_gowin -nodram
write_verilog synth.v
