read_verilog ../top.v
synth_sf2 -json json.json
write_verilog synth.v 
