read_verilog ../top.v
synth_coolrunner2 -run begin:json
write_verilog synth.v 
