read_verilog ../top.v
synth_ecp5 -retime
write_verilog synth.v 
