read_verilog ../top.v
synth_coolrunner2 -noflatten
write_verilog synth.v 
