read_verilog ../top.v
synth_xilinx -widemux 2
write_verilog synth.v
