read_verilog ../top.v
select dffe
synth_intel
write_verilog synth.v
