read_verilog ../top.v
synth_anlogic -retime
write_verilog synth.v
