read_verilog ../top.v
select dffe
synth_coolrunner2
write_verilog synth.v
