read_verilog ../top.v
synth_ecp5 -flatten
write_verilog synth.v 
