read_verilog ../top.v
synth_gowin -nobram
write_verilog synth.v
