read_verilog ../top.v
synth_intel -noflatten
write_verilog synth.v 
