read_verilog ../top.v
synth_anlogic -top top
write_verilog synth.v
