read_verilog ../top.v
synth_ice40 -noabc
write_verilog synth.v
