read_verilog ../top.v
synth_gowin -top top
write_verilog synth.v 
