read_verilog ../top.v
synth_intel -family cyclone10
write_verilog synth.v 
