read_verilog ../top.v
synth_sf2 -edif edif.edif
write_verilog synth.v 
