read_verilog ../top.v
synth_easic -top top
write_verilog synth.v 
