read_verilog ../top.v
synth_ice40 -dsp
write_verilog synth.v
