read_verilog ../top.v
synth_achronix -noflatten
write_verilog synth.v 
