read_verilog ../top.v
synth_xilinx -nowidelut
write_verilog synth.v
