read_verilog ../top.v
proc
async2sync
tee -o result.log dump
synth -top top
write_verilog synth.v
