read_verilog ../top.v
proc
design -save top
design -import top
write_verilog synth.v
