read_verilog ../top.v
synth -top top
flowmap -cells $dff top
write_verilog synth.v
