read_verilog ../top.v
synth -top top
flowmap -minlut 2 top
write_verilog synth.v
