read_verilog ../top.v
proc
memory_bram -rules uuu
tee -o result.log dump
design -reset
read_verilog ../top.v
synth -top top
write_verilog synth.v
