read_verilog ../top.v
proc
fsm_detect
fsm_extract
opt -clkinv
synth -top top
write_verilog synth.v
