read_verilog ../top.v
prep -rdff
synth -top top
write_verilog synth.v
