read_verilog ../top.v
prep -memx
synth -top top
write_verilog synth.v
