read_verilog ../top.v
synth -noshare
write_verilog synth.v
