read_verilog ../top.v
synth -noabc
write_verilog synth.v
