read_verilog ../top.v
techmap -wb
write_verilog synth.v
