read_verilog -sv ../top.v
synth -top top
write_blif -buf a a a blif.blif
write_verilog synth.v 
