read_verilog ../top.v
synth -top top
write_simplec -i8 c.c
write_verilog synth.v 
