read_verilog -sv ../top.v
memory_collect
proc
write_btor btor.btor
design -reset
read_verilog  -sv ../top.v
synth -top top
write_verilog synth.v 
