tee -o result.log read_verilog -formal  ../top.v
synth -top top
write_verilog synth.v
