read_verilog ../top.v
synth_ice40 -top main -blif stencil.blif
write_verilog synth.v

