tee -o result.log read_verilog ../top.v
synth -top top
write_verilog synth.v
