read_verilog ../top.v
hierarchy
splitnets -ports
write_verilog synth.v
