read_verilog ../top3.v
proc
memory
write_smt2 smt2.smt2
write_verilog synth.v
