read_verilog -sv ../top.v
synth -top top
write_blif -true a a blif.blif
write_verilog synth.v 
