read_verilog ../top.v
synth -top top
tee -o result.log abc -constr -liberty
abc -constr -liberty
