read_verilog -sv ../top.v
design -save first
tee -o result.log design -import first
