read_verilog ../top.v
synth
insbuf
tee -o result.log dump
write_verilog synth.v
