read_verilog ../top.v
proc
select -add top -add middle
tee -o result.log select -list
