read_verilog -sv ../top.v
splitnets -format ()
tee -o result.log dump
