read_verilog ../top.v
synth -top top
tee -o result.log test_cell -script ../test_cell_scr.ys $add
