read_verilog ../top1.v
proc
memory
write_smt2 smt2.smt2
write_verilog synth.v
