read_verilog -sv ../top.v
proc
clk2fflogic
chformal -early
tee -o result.log dump
