read_verilog ../top.v
synth_ice40
ice40_wrapcarry
write_verilog synth.v
