read_verilog ../top.v
synth_ice40 -device unknown
write_verilog synth.v
