read_verilog ../top.v
synth_sf2 -clkbuf
write_verilog synth.v
