read_verilog ../top.v
synth_intel -retime
write_verilog synth.v 
