read_verilog ../top.v
synth_sf2 -run begin:json
write_verilog synth.v 
