read_verilog ../top.v
synth_anlogic -noflatten
write_verilog synth.v
