read_verilog ../top.v
synth_intel -family max10
write_verilog synth.v 
