read_verilog ../top.v
synth_ecp5 -abc9 -nowidelut
write_verilog synth.v
