read_verilog ../top.v
synth_intel -run family:vpr
write_verilog synth.v 
