read_verilog ../top.v
synth_ice40 -abc2
write_verilog synth.v 
