read_verilog ../top.v
synth_ice40
write_verilog synth.v 
