read_verilog ../top.v
synth_ecp5 -vpr
write_verilog synth.v 
