read_verilog ../top.v
select top2
synth_achronix
write_verilog synth.v
