read_verilog ../top.v
synth_ice40 -top top
write_verilog synth.v 
