read_verilog ../top.v
synth_anlogic
write_verilog synth.v
