read_verilog ../top.v
synth_xilinx -arch xcup
write_verilog synth.v
