read_verilog ../top.v
synth_ice40 -relut
write_verilog synth.v
