read_verilog ../top.v
synth_greenpak4 -part SLG46620V
write_verilog synth.v 
