read_verilog ../top.v
synth_efinix -noflatten
write_verilog synth.v
