read_verilog ../top.v
synth_coolrunner2
write_verilog synth.v 
