read_verilog -noautowire ../top.v
synth -top top
write_verilog synth.v
