read_verilog -specify ../top.v
synth -top top
write_verilog synth.v
