read_verilog -noassert ../top.v
synth -top top
write_verilog synth.v
