read_verilog ../top.v
proc
write_json json.json
design -reset
read_json json.json
write_verilog synth.v
