read_verilog ../top.v
proc
prep -flatten
write_verilog synth.v
