read_verilog ../outreg.v
synth_ecp5
rename dut dut_syn
write_verilog -norename synth.v
