read_verilog -sv ../top.v
prep -top top -nordff
write_smt2 top.smt2
design -reset
read_verilog  -sv ../top_clean.v
synth -top top
write_verilog synth.v
