read_verilog ../top.v
synth_xilinx
select -assert-count 4 t:FDRE
